## 2.1 Sorting Data Frames

Use the `sort_index()` method

In [3]:
import pandas

In [5]:
# load the kaggle.com titanic dataset
url = "https://raw.github.com/mattdelhey/kaggle-titanic/master/Data/train.csv"
titanic = pandas.read_csv(url)

titanic.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

###  2.13 Use value_counts to summarize by unique factor

In [7]:
titanic.pclass.value_counts()

3    491
1    216
2    184
dtype: int64

###  2.14 Subset dataframe: df.loc[ rows, cols]

Subsets can be:

* df.loc[r, ]
* df.loc[r, : ]
* df.loc[ : , c]
* df.loc[ r1:rn , c1: ]
* df.loc[ [r3,r4,r1] , :cn ]

(":" means "all")

In [60]:
# subsetting rows
fare13 = titanic.loc[titanic.fare == 13, ]

fare13 = fare13.set_index(fare13.name)

fare13.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Williams, Mr. Charles Eugene",1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13,NaN,S
"Beesley, Mr. Lawrence",1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13,D56,S
"Webber, Miss. Susan",1,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13,E101,S
"Sobey, Mr. Samuel James Hayden",0,2,"Sobey, Mr. Samuel James Hayden",male,25.0,0,0,C.A. 29178,13,NaN,S
"Byles, Rev. Thomas Roussel Davids",0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13,NaN,S

In [62]:
# subsetting columns

titanic.loc[ : , ['name', 'survived', 'sex'] ].head()

                                                name  survived     sex
0                            Braund, Mr. Owen Harris         0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1  female
2                             Heikkinen, Miss. Laina         1  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)         1  female
4                           Allen, Mr. William Henry         0    male

### 2.15 Sorting - the sort_index() function

In [26]:
# index has been set to "name" columns

fare13.head(3)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Williams, Mr. Charles Eugene",1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13,NaN,S
"Beesley, Mr. Lawrence",1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13,D56,S
"Webber, Miss. Susan",1,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13,E101,S

In [27]:
# sort by row labels

fare13.sort_index().head(3)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Ball, Mrs. (Ada E Hall)",1,2,"Ball, Mrs. (Ada E Hall)",female,36,0,0,28551,13,D,S
"Beesley, Mr. Lawrence",1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13,D56,S
"Berriman, Mr. William John",0,2,"Berriman, Mr. William John",male,23,0,0,28425,13,NaN,S

In [28]:
# sort by column labels - use column axis (1)

fare13.sort_index(axis=1).head(3)

,age,cabin,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket
name,,,,,,,,,,,
"Williams, Mr. Charles Eugene",NaN,NaN,S,13,"Williams, Mr. Charles Eugene",0,2,male,0,1,244373
"Beesley, Mr. Lawrence",34.0,D56,S,13,"Beesley, Mr. Lawrence",0,2,male,0,1,248698
"Webber, Miss. Susan",32.5,E101,S,13,"Webber, Miss. Susan",0,2,female,0,1,27267

In [77]:
# sort by column values using order() -- returns a series object

# sort by age
show = fare13.age.order(ascending=False).head()

# includes index and values of age column
show

name
Greenberg, Mr. Samuel                52
Hodges, Mr. Henry Price              50
Milling, Mr. Jacob Christian         48
Hosono, Mr. Masabumi                 42
Byles, Rev. Thomas Roussel Davids    42
Name: age, dtype: float64

In [76]:
# order() returns a series object

type(show)

pandas.core.series.Series

In [85]:
# sort column values using sort_index() //not order()

fare13.sort_index(ascending=False, by = 'age').head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Greenberg, Mr. Samuel",0,2,"Greenberg, Mr. Samuel",male,52,0,0,250647,13,NaN,S
"Hodges, Mr. Henry Price",0,2,"Hodges, Mr. Henry Price",male,50,0,0,250643,13,NaN,S
"Milling, Mr. Jacob Christian",0,2,"Milling, Mr. Jacob Christian",male,48,0,0,234360,13,NaN,S
"Bystrom, Mrs. (Karolina)",1,2,"Bystrom, Mrs. (Karolina)",female,42,0,0,236852,13,NaN,S
"Byles, Rev. Thomas Roussel Davids",0,2,"Byles, Rev. Thomas Roussel Davids",male,42,0,0,244310,13,NaN,S

In [88]:
# sort by 2 columns
fare13.sort_index(ascending=[False,True], by=['age', 'name']).head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Greenberg, Mr. Samuel",0,2,"Greenberg, Mr. Samuel",male,52,0,0,250647,13,NaN,S
"Hodges, Mr. Henry Price",0,2,"Hodges, Mr. Henry Price",male,50,0,0,250643,13,NaN,S
"Milling, Mr. Jacob Christian",0,2,"Milling, Mr. Jacob Christian",male,48,0,0,234360,13,NaN,S
"Byles, Rev. Thomas Roussel Davids",0,2,"Byles, Rev. Thomas Roussel Davids",male,42,0,0,244310,13,NaN,S
"Bystrom, Mrs. (Karolina)",1,2,"Bystrom, Mrs. (Karolina)",female,42,0,0,236852,13,NaN,S

In [91]:
# 10 oldest people
top10 = fare13.age.order(ascending=False).head(10)

top10

name
Greenberg, Mr. Samuel                52
Hodges, Mr. Henry Price              50
Milling, Mr. Jacob Christian         48
Hosono, Mr. Masabumi                 42
Byles, Rev. Thomas Roussel Davids    42
Bystrom, Mrs. (Karolina)             42
Smith, Miss. Marion Elsie            40
Meyer, Mr. August                    39
Otter, Mr. Richard                   39
Funk, Miss. Annie Clemmer            38
Name: age, dtype: float64

In [92]:
# still a series, index is the name
type(top10)

pandas.core.series.Series

In [149]:
# plot the top 10 salaries
import matplotlib
import matplotlib.pyplot

# magic method required to initialize plot functions
#%matplotlib

In [150]:
# initialize top-level plot container
matplotlib.pyplot.figure()

top10.plot(label='Ages')
matplotlib.pyplot.tick_params(axis='x', labelbottom='off')
matplotlib.pyplot.xlabel(s='Person')
matplotlib.pyplot.legend()